# config.py
"""
Центральный файл конфигурации.
Укажите здесь ваши данные один раз, и все остальные скрипты будут их использовать.
"""

# --- Telegram Credentials (ОБЯЗАТЕЛЬНО ЗАПОЛНИТЬ) ---
# 1. Возьмите эти данные из my.telegram.org
# 2. Убедитесь, что вы вошли в аккаунт хотя бы раз, чтобы создался файл сессии.
API_ID = 123  # 👈 Замените на ваш API ID
API_HASH = "123"  # 👈 Замените на ваш API HASH

# Имя файла для хранения сессии Telegram. Должно быть одинаковым для всех скриптов.
SESSION_NAME = "telegram_session" 

CHARACTER_ID = 2